app/views/bathrooms/show.html.erb

<h3>Reviews: </h3>
<% @bathroom.reviews.each do |review| %>
  <div class="container">
    <h5><%= User.find(review.user_id).name %></h5>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."bathroom_id" = ?  [["bathroom_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]


  <p> <%= button_to "Back to " + Building.find(@bathroom.building_id).name, Building.find(@bathroom.building_id), :method => :get %> </p>
---
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]