app/views/users/show.html.erb

<h1><%= @user.name %></h1>
<% @user.reviews.each do |review| %>
  <div class="container">
    <h5><%= Building.find(Bathroom.find(review.bathroom_id).building_id).name %>, Floor <%=Bathroom.find(review.bathroom_id).floor%></h5>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."user_id" = ?  [["user_id", 2]]
SELECT  "bathrooms".* FROM "bathrooms" WHERE "bathrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]