app/views/home/index.html.erb

<h1>Welcome to Find Your Shit, <%= @user.name %>!</h3>
<p>Registered Reviewers: <%= User.count %> </p>
---
SELECT COUNT(*) FROM "users"