app/views/buildings/_building.html.erb

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<td><%=building.floors%> floors</td>
<td><%= link_to Area.find(building.area_id).name, Area.find(building.area_id) %></td>