app/views/areas/show.html.erb

SELECT "buildings".* FROM "buildings" WHERE "buildings"."area_id" = ?  [["area_id", 4]]
---
        <tbody>
          <% @area.buildings.each do |building| %>