app/controllers/areas_controller.rb

SELECT "areas".* FROM "areas"
---
  def index
    @areas = Area.all

SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @area = Area.find(params[:id])

INSERT INTO "areas" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "College of Engineering"], ["created_at", "2017-11-28 02:32:02.953566"], ["updated_at", "2017-11-28 02:32:02.953566"]]
---
  def create
    @area = Area.new(area_params)
    if @area.save!