app/controllers/bathrooms_controller.rb

  def show
    @bathroom = Bathroom.find(params[:id])
---
SELECT  "bathrooms".* FROM "bathrooms" WHERE "bathrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @bathroom = Bathroom.new(bathroom_params)
    @bathroom.area_id = Building.find(@bathroom.building_id).area_id
    if @bathroom.save!
---
SELECT  "areas".* FROM "areas" WHERE "areas"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "bathrooms" ("gender", "building_id", "area_id", "created_at", "updated_at", "floor") VALUES (?, ?, ?, ?, ?, ?)  [["gender", "Male"], ["building_id", 2], ["area_id", 2], ["created_at", "2017-11-29 01:42:25.190762"], ["updated_at", "2017-11-29 01:42:25.190762"], ["floor", 1]]