app/controllers/buildings_controller.rb

INSERT INTO "buildings" ("name", "area_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "cat"], ["area_id", 3], ["created_at", "2017-11-26 13:06:11.095928"], ["updated_at", "2017-11-26 13:06:11.095928"]]
UPDATE "buildings" SET "floors" = ?, "updated_at" = ? WHERE "buildings"."id" = ?  [["floors", nil], ["updated_at", "2017-11-26 13:40:52.704751"], ["id", 8]]
---
  def create
    @building = Building.create(building_params)
    if @building.save!

SELECT "buildings".* FROM "buildings"
---
  def index
    @buildings = Building.all

SELECT  "buildings".* FROM "buildings" WHERE "buildings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @user = current_user
    @building = Building.find(params[:id])