app/controllers/reviews_controller.rb

  def new
    @review = Review.new(bathroom_id: params[:bathroom_id])
    @bathroom = Bathroom.find(params[:bathroom_id])
---
SELECT  "bathrooms".* FROM "bathrooms" WHERE "bathrooms"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    @review = Review.create(review_params)
    @review.user_id = current_user.id
    if @review.save!
      redirect_to Bathroom.find(@review.bathroom_id)
---
INSERT INTO "reviews" ("title", "body", "bathroom_id", "user_id", "rating", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "cool"], ["body", "it was nice"], ["bathroom_id", 1], ["user_id", 1], ["rating", 1], ["created_at", "2017-11-29 03:49:19.019919"], ["updated_at", "2017-11-29 03:49:19.019919"]]
SELECT  "bathrooms".* FROM "bathrooms" WHERE "bathrooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]